trade/src/Documents/СписаниеКодовМаркировкиИСМП/СписаниеКодовМаркировкиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеКодовМаркировкиИСМП</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеСписаниеКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдрес</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>EnumRef.ПричиныСписанияКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПервичногоДокумента</name>
    <type>
      <types>EnumRef.ВидыПервичныхДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПервичногоДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводственнойЛинии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNОрганизации</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФИАС</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаСписания</name>
      <type>
        <types>EnumRef.ПричиныСписанияКодовМаркировкиИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребительскихУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеОтчетаПроизводственнойЛинии</name>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормализованноеЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормализованноеЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматBase64</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибкиЗначениеШтрихкода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибкиЗначениеШтрихкодаУпаковки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Enums/ПричиныСписанияКодовМаркировкиИСМП/ПричиныСписанияКодовМаркировкиИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныСписанияКодовМаркировкиИСМП</name>
  <enumValues>
    <name>ВыбытиеДоОбязательностиМаркировки</name>
  </enumValues>
  <enumValues>
    <name>ДемонстрационныеОбразцы</name>
  </enumValues>
  <enumValues>
    <name>ИспользованиеДляСобственныхНуждСУплатойАкциза</name>
  </enumValues>
  <enumValues>
    <name>Испорчен</name>
  </enumValues>
  <enumValues>
    <name>ИстечениеСрока</name>
  </enumValues>
  <enumValues>
    <name>КонфискацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЛабораторныеОбразцы</name>
  </enumValues>
  <enumValues>
    <name>ЛиквидацияПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ОтзывСРынка</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Рекламации</name>
  </enumValues>
  <enumValues>
    <name>ТестированиеПродукта</name>
  </enumValues>
  <enumValues>
    <name>Уничтожен</name>
  </enumValues>
  <enumValues>
    <name>Утерян</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ВидыПродукцииИС/ВидыПродукцииИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПродукцииИС</name>
  <enumValues>
    <name>Алкогольная</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Фотоаппараты</name>
  </enumValues>
  <enumValues>
    <name>Духи</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>УпакованнаяВода</name>
  </enumValues>
  <enumValues>
    <name>МолочнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>БАДы</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияИзНатуральногоМеха</name>
  </enumValues>
  <enumValues>
    <name>Зерно</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗерна</name>
  </enumValues>
  <enumValues>
    <name>СоковаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МорепродуктыПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПодконтрольнаяПродукцияСАТУРН</name>
  </enumValues>
  <enumValues>
    <name>ЗерноВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПродуктыПереработкиЗернаВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>МясоПодконтрольноеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарныеПрепараты</name>
  </enumValues>
  <enumValues>
    <name>ИгрыИИгрушкиДляДетей</name>
  </enumValues>
  <enumValues>
    <name>РадиоэлектроннаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ТитановаяМеталлопродукция</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>ОптоволокноИОптоволоконнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КонсервированнаяПродукцияБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПечатнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>СтроительныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>ОтопительныеПриборы</name>
  </enumValues>
  <enumValues>
    <name>Бакалея</name>
  </enumValues>
  <enumValues>
    <name>АлкогольнаяПродукцияДо9Процентов</name>
  </enumValues>
  <enumValues>
    <name>ТелефоныИНоутбуки</name>
  </enumValues>
  <enumValues>
    <name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</name>
  </enumValues>
  <enumValues>
    <name>КабельнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>МоторныеМасла</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольныеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ПивоВПотребительскихУпаковках</name>
  </enumValues>
  <enumValues>
    <name>ТехническиеСредстваРеабилитации</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия20</name>
  </enumValues>
  <enumValues>
    <name>ЛегкаяПромышленность2025</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотныхВлажныеБезВЕТИС</name>
  </enumValues>
  <enumValues>
    <name>ПолимерныеТрубы</name>
  </enumValues>
  <enumValues>
    <name>СладостиИКондитерскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>ПечатныеПлаты</name>
  </enumValues>
  <enumValues>
    <name>ДезинфицирующиеСредства</name>
  </enumValues>
  <enumValues>
    <name>БАДы2025</name>
  </enumValues>
  <enumValues>
    <name>АвтозапчастиИКомплектующиеТранспортныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СпортивноеПитание</name>
  </enumValues>
  <enumValues>
    <name>РастворимыеЗавариваемыеНапитки</name>
  </enumValues>
  <enumValues>
    <name>ТоварыЛичнойГигиены</name>
  </enumValues>
  <enumValues>
    <name>БритвыИЛезвия</name>
  </enumValues>
  <enumValues>
    <name>НапиткиССодержаниемМолокаКакаоПрочие</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ВидыПервичныхДокументовИСМП/ВидыПервичныхДокументовИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПервичныхДокументовИСМП</name>
  <enumValues>
    <name>КассовыйЧек</name>
  </enumValues>
  <enumValues>
    <name>ТоварныйЧек</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>ТаможеннаяДекларация</name>
  </enumValues>
  <enumValues>
    <name>АктУничтожения</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>АктПротезноОртопедическогоИзделия</name>
  </enumValues>
</mdclass:Enum>

trade/src/Documents/СписаниеКодовМаркировкиИСМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		ШтрихкодыУпаковок.Очистить();
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		ЗаполнитьНепришедшиеКоды(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ПричинаСписания = Перечисления.ПричиныСписанияКодовМаркировкиИСМП.ВыбытиеДоОбязательностиМаркировки Тогда
		Операция = Перечисления.ВидыОперацийИСМП.СписаниеКодовВыбывшихДоОбязательностиМаркировки;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПотребительскихУпаковок");
	
	ЭтоСписаниеПриПоступленииКИЗ = Операция = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиПриПоступлении;
	ИспользуетсяОсновнойДокументСписания = ИнтеграцияИСКлиентСервер.ИспользуетсяОсновнойДокументСписания(ПричинаСписания);
	
	ЭтоМех = ВидПродукции = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;
	
	Если ОтчетПроизводственнойЛинии Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
	ИначеЕсли ЭтоСписаниеПриПоступленииКИЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		МассивНепроверяемыхРеквизитов.Добавить("ДанныеОтчетаПроизводственнойЛинии");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ДанныеОтчетаПроизводственнойЛинии");
	КонецЕсли;
	
	Если Не ЭтоСписаниеПриПоступленииКИЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("GLNОрганизации");
	КонецЕсли;

	Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
		Или Не ИспользуетсяОсновнойДокументСписания Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидПервичногоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПервичногоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("НомерПервичногоДокумента");
		МассивНепроверяемыхРеквизитов.Добавить("НаименованиеПервичногоДокумента");
		
	ИначеЕсли ВидПервичногоДокумента <> Перечисления.ВидыПервичныхДокументовИСМП.Прочее Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("НаименованиеПервичногоДокумента");
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.GTIN");

	Если ИнтеграцияИСКлиентСервер.ВидПродукцииИспользуетПередачуОтчетаОбОтбраковкеЧерезСУЗ(ВидПродукции)
		Или ЭтоСписаниеПриПоступленииКИЗ
		Или ИспользуетсяОсновнойДокументСписания Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаСписания");
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъект");
		Если ЭтоМех И Не ЭтоСписаниеПриПоступленииКИЗ Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПричинаСписания");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаСписания");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(ВидПродукции)
		И ИспользуетсяОсновнойДокументСписания Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("GLNОрганизации");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственнойЛинии"); 
		
	ИначеЕсли ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияИСМП(ВидПродукции) Тогда
		
		Если Не ((ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво
				Или ВидПродукции = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках)
			И ИспользуетсяОсновнойДокументСписания) Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектАдресСтрокой");
		КонецЕсли;
		
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектИдентификатор");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственногоЗаказа");
		МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственнойЛинии");
		
		Если Не ЭтоСписаниеПриПоступленииКИЗ Тогда
			
			Для Каждого СтрокаТовары Из Товары Цикл
				Если Не ЗначениеЗаполнено(СтрокаТовары.GTIN)
					И Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					ТекстСообщения = СтрШаблон(
						НСтр(
							"ru = 'В строке %1 табличной части Товары не заполнено поле GTIN'"),
							СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
						Отказ);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ((ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво
			Или ВидПродукции = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках)
		И ИспользуетсяОсновнойДокументСписания) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КодФИАС");
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если Не ЭтоСписаниеПриПоступленииКИЗ Тогда
		ИнтеграцияИСМПСлужебный.ПроверитьЗаполнениеШтрихкодовУпаковок(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ИнтеграцияИСМП.ПроверкаЗаполненияКоличестваПотребительскихУпаковок(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	ШтрихкодыУпаковок.Очистить();
	ИдентификаторПроизводственногоЗаказа = "";
	ИдентификаторПроизводственнойЛинии   = "";
	ДанныеОтчетаПроизводственнойЛинии.Очистить();
	
	ВидПервичногоДокумента          = Неопределено;
	ДатаПервичногоДокумента         = "";
	НомерПервичногоДокумента        = "";
	НаименованиеПервичногоДокумента = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияСписанияКодовМаркировкиИСМП(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНепришедшиеКоды(ДанныеЗаполнения)
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
